src/artilleryplaywright.yml
config:
  target: https://dev.oneid.pagopa.it/login?response_type=CODE&scope=openid&client_id=8U61NU_F8NMFDnTdW5zUt04MJ7wYRD_WgQbihbeenFg&state=dev&nonce=11701879fd734d1486b8a6435025b465&redirect_uri=https://442zl6z6sbdqprefkazmp6dr3y0nmnby.lambda-url.eu-south-1.on.aws/client/cb
  phases:
     - arrivalCount: 900
       #rampTo: 8
       duration: 300
        # Load the Playwright engine:
  engines:
    playwright:
      launchOptions:
        headless: true
      defaultTimeout: 120 # Timeout di 2 minuti
  # Path to JavaScript file that defines Playwright test functions
  processor: './artilleryplaywright.js'
scenarios:
  - engine: playwright
    flowFunction: "oi"