src/artilleryplaywright_ramp.yml
# Command for run: WORKER_IMAGE_URL=public.ecr.aws/d8a4z9o5/artillery-worker:a0b6328719a1223118c362ab923476b97f5a1e83 artillery run-fargate --region eu-central-1 --count 2 --launch-config '{"cpu": 4096, "memory": 8192}' artilleryplaywright_ramp.yaml
config:
  target: https://dev.oneid.pagopa.it/login?response_type=CODE&scope=openid&client_id=8U61NU_F8NMFDnTdW5zUt04MJ7wYRD_WgQbihbeenFg&state=dev&nonce=11701879fd734d1486b8a6435025b465&redirect_uri=https://442zl6z6sbdqprefkazmp6dr3y0nmnby.lambda-url.eu-south-1.on.aws/client/cb
  phases:
    - duration: 120
      arrivalRate: 1
      rampTo: 2
      name: Warm up the API
    - duration: 120
      arrivalRate: 2
      rampTo: 3
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 3
      name: Sustained peak load
  engines:
    playwright:
      launchOptions:
        headless: true
      defaultTimeout: 120
  processor: './flows.js'
scenarios:
  - engine: playwright
    flowFunction: "oi"